In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('train.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
df.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='object')

In [17]:
# удалеям столбцы
df.drop(["PassengerId", "Cabin", "Ticket", "Cabin"], axis = 1, inplace = True) # inplace - адаптирует DF

KeyError: "['PassengerId' 'Cabin' 'Ticket' 'Cabin'] not found in axis"

In [14]:
# окгруляем стоимость до двух знаков после запятой

df.Fare.round(2)
# df["Fare"] = round(df["Fare"], 2) # - другой метод исполнения кода
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.25,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.28,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.92,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.10,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.05,S
...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,13.00,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.00,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,23.45,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,30.00,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,7.75,Q

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Name        891 non-null object
Sex         891 non-null object
Age         714 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    891 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

#### Заполняем пустые значения через метод fillna(). Так же есть метод ffill - он заполняет строку исходя из данных в предшествующей или последующей строки.

In [32]:
df.Embarked.fillna("NoData")
df.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [42]:
df.Embarked.fillna(df.Embarked.value_counts().index[0], inplace = True) 
# замена всех значений на самые часто повторяющиеся значения (S)

### Заполняем пропущенные данные о возрасте двумя способами

In [65]:
# Способ 1: Средние арифметические
df.Age.fillna(df.Age.mean())
# df_age = df["Age"].fillna(df["Age"].mean()) - другой метод исполнения кода
print(df_age.head(10))

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [75]:
df.Age.fillna(round(df.Age.mean(), 2)) # округляем значения до 2х знаков

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    29.7
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [ ]:
# Способ 2: Cредние арифметические в зависимости от класса каюты
age_1 = df[df['Pclass'] == 1]['Age'].mean()
age_2 = df[df['Pclass'] == 2]['Age'].mean()
age_3 = df[df['Pclass'] == 3]['Age'].mean()

In [72]:
age_1 = df[df.Pclass == 1].Age.mean()
age_2 = df[df.Pclass == 2].Age.mean()
age_3 = df[df.Pclass == 3].Age.mean()

In [76]:
def fill_age(row):
    if pd.isnull(row.Age):
        if row.Pclass == 1:
            return age_1
        if row.Pclass == 2:
            return age_2
        return age_3
    return row.Age

In [77]:
df.Age = df.apply(fill_age, axis = 1)

In [80]:
df.info() # возраст заполнился согласно функции fill_age
df.columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Name        891 non-null object
Sex         891 non-null object
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    891 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='object')

### Feature Engineering | <br> Создаем новый столбец с информацией о том, был ли пассажир на борту один или с родственниками

In [110]:
# Способ 1 - именная функция и apply

def is_alone(row):
    if row.SibSp + row.Parch == 0:
        return 0
    return 1

In [111]:
df["alone"] = df.apply(is_alone, axis = 1)

In [114]:
df.head(10)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,alone
0,0,3,"Braund, Mr. Owen Harris",male,22.00000,1,0,7.25,S,1
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00000,1,0,71.28,C,1
2,1,3,"Heikkinen, Miss. Laina",female,26.00000,0,0,7.92,S,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.00000,1,0,53.10,S,1
4,0,3,"Allen, Mr. William Henry",male,35.00000,0,0,8.05,S,0
5,0,3,"Moran, Mr. James",male,25.14062,0,0,8.46,Q,0
6,0,1,"McCarthy, Mr. Timothy J",male,54.00000,0,0,51.86,S,0
7,0,3,"Palsson, Master. Gosta Leonard",male,2.00000,3,1,21.08,S,1
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.00000,0,2,11.13,S,1
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.00000,1,0,30.07,C,1

In [113]:
# cпособ 2 - Lambda функция

df.alone = df.apply(lambda row: 1 if row.SibSp + row.Parch != 0 else 0, axis = 1)

In [115]:
# Построим сводную таблицу (pivot_table), в которой отразим количество погибших и выживших 
# из числа путешествовавших в одиночку или с родственниками

df.pivot_table(index = "Survived", columns = "alone", values = "Age", aggfunc = "count")

alone       0    1
Survived
0         374  175
1         163  179

### Дополнительные приемы работы с числами

In [116]:
new_df = pd.DataFrame({'col1': [1,2,3,4,5], 
                       'col2': '2,5 4,5 3.3 1,5 2,9'.split()
                      })

In [122]:
new_df

   col1 col2
0     1  2.5
1     2  4.5
2     3  3.3
3     4  1.5
4     5  2.9

In [123]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
col1    5 non-null int64
col2    5 non-null object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [119]:
new_df.col2.sum()

'2,54,53.31,52,9'

In [120]:
# преобразование данных в адекватный формат (исключение запятых) - шаг 1
# с помощью lambda-функции

new_df.col2 = new_df.col2.apply(lambda x: x.replace(",", "."))

##### преобразование значений в числовой формат - шаг 2
##### Три способа - работают только с точкой

#### Способ 1

In [126]:
new_df.col2 = pd.to_numeric(new_df.col2) # классчиский способ через Pandas

#### Способ 2

In [127]:
new_df.col2 = new_df.col2.astype("float64", inplace = True) # более оптимальное управление памятью + типом данных

#### Способ 3

In [128]:
new_df.col2 = new_df.col2.apply(lambda x: float(x)) # с помощью стандартной библиотеки без Pandas